* and more like vlan and bridge
  
#+BEGIN_SRC emacs-lisp
(setf bonding '(nic1 nic2))
(cons (cons bonding 'vlan) 'bridge)
#+END_SRC

#+RESULTS:
: (((nic1 nic2) . vlan) . bridge)

